/*
 * 	데이터 저장 ==== 데이터 가공 ==== 화면 출력
 * 		|			|			= 윈도우/도스
 *					|			= 브라우저
 *				 연산처리
 *				 (연산자)
 *				 흐름제어
 *				 (제어문) 
 * 
 * 	한개: 변수
 * 	여러개: 배열 / 클래스
 *  
 *  변수 => 연산자 = 제어문 = 메소드 = 객체지향 = 설계/기능처리/조립
 *  										|
 *  									라이브러리 활용
 *  										|
 *  									오류방지(예외처리)
 *  										|
 *  									응용프로그램
 *  									=> 네트워크 / 데이터베이스
 *  												========
 *  
 *  사용자 정의 데이터형 1,2,4,8 =>클래스
 *  
 *  1.	선언 => 반드시 초기화 => 나중에 변경해서 사용이 가능
 * 		데이터형 변수명=값
 * 		-------------
 * 		미리 => 어떤 데이터가 필요한지 확인
 * 	2.	필요시에 데이터형을 변경이 가능
 * 			------------------------ 형변환
 * 		= 자동 형변환
 * 		   : 작은 데이터를 큰 데이터형으로 변경
 * 		   : upcasting
 * 	  	= 강제 형변환
 * 		   : 큰 데이터형를 작은 데이터형으로 변경
 * 		   : downcasting
 * 
 * p52 이것이 자바다 1권 특수문자. \의 활용
 * 
 * 연산자의 종류
 * 
 * 피연산자 1개일 경우 : 단항연산자
 * 	단항연산자
 * 		= 증감연산자 (1증가 / 1감소)
 *			++, --
 *		= 부정연산자
 *			!
 *		=형변환 연산자
 *		  (데이터형)
 *	피연산자 2개일 경우 : 이항연산자
 * 		= 산술연산자
 * 			+.-,*,/....
 * 		= 비교연산자
 * 		= 대입연산자
 * 		= 기타연산자
 * 			비트이동 연산자
 * 			<<, >>
 * 			비트연산자
 * 			& , | , ^(XOR)
 */

public class 연산자종류 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
